; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v7 - type_2 ?v5 - type_1)
 	      (pred_2 ?v4 - object ?v5 - type_1)
	      (pred_4 ?v7 - type_2 ?v8 - type_3)
	      (pred_1 ?v7 - type_2 ?v4 - object ?v8 - type_3))

   (:action op_1
       :parameters  (?v7 - type_2 ?v6 ?v3 - type_1)
       :precondition (and  (pred_3 ?v7 ?v6))
       :effect (and  (pred_3 ?v7 ?v3)
		     (not (pred_3 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_2 ?v1 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v2) (pred_3 ?v7 ?v2) (pred_4 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v1 ?v8)
		    (not (pred_2 ?v1 ?v2)) 
		    (not (pred_4 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_2 ?v1 - object ?v2 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v7 ?v1 ?v8) (pred_3 ?v7 ?v2))
       :effect (and (pred_2 ?v1 ?v2)
		    (pred_4 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v1 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_2
obj_12 obj_10 obj_01 obj_05 - type_3
obj_11 obj_06 obj_04 - type_1
obj_08 obj_03 obj_02 - object)
(:init
(pred_3 obj_09 obj_04)
(pred_4 obj_09 obj_12)
(pred_4 obj_09 obj_10)
(pred_3 obj_07 obj_11)
(pred_4 obj_07 obj_01)
(pred_4 obj_07 obj_05)
(pred_2 obj_08 obj_04)
(pred_2 obj_03 obj_11)
(pred_2 obj_02 obj_06)
)
(:goal
(and
(pred_2 obj_08 obj_11)
(pred_2 obj_03 obj_04)
(pred_2 obj_02 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_09 obj_04) (pred_3 obj_07 obj_04))))
  )
)
)

; plan
1. (op_2 obj_07 obj_03 obj_11 obj_05)
   deleted: (pred_2 obj_03 obj_11) (pred_4 obj_07 obj_05)
   added: (pred_1 obj_07 obj_03 obj_05)
   goals met: 1 of 3
2. (op_2 obj_09 obj_08 obj_04 obj_10)
   deleted: (pred_2 obj_08 obj_04) (pred_4 obj_09 obj_10)
   added: (pred_1 obj_09 obj_08 obj_10)
   goals met: 1 of 3
3. (op_1 obj_09 obj_04 obj_11)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_11)
   goals met: 1 of 3
4. (op_1 obj_07 obj_11 obj_04)
   deleted: (pred_3 obj_07 obj_11)
   added: (pred_3 obj_07 obj_04)
   goals met: 1 of 3
5. (op_3 obj_07 obj_03 obj_04 obj_05)
   deleted: (pred_1 obj_07 obj_03 obj_05)
   added: (pred_2 obj_03 obj_04) (pred_4 obj_07 obj_05)
   goals met: 2 of 3
6. (op_3 obj_09 obj_08 obj_11 obj_10)
   deleted: (pred_1 obj_09 obj_08 obj_10)
   added: (pred_2 obj_08 obj_11) (pred_4 obj_09 obj_10)
   goals met: 3 of 3
